SOAP Test Application/Templates/EWS/UpdateItem (Message).xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:xsd="http://www.w3.org/2001/XMLSchema"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages">
  <soap:Body>
    <m:UpdateItem MessageDisposition="SaveOnly" ConflictResolution="AutoResolve">
      <m:ItemChanges>
        <t:ItemChange>
          <!--FIELD:ItemId;FullItemId-->
          <t:Updates>
            <t:SetItemField>
              <t:FieldURI FieldURI="message:IsRead" />
              <t:Message>
                <t:IsRead><!--FIELD:IsRead;boolean--></t:IsRead>
              </t:Message>
            </t:SetItemField>
          </t:Updates>
        </t:ItemChange>
      </m:ItemChanges>
    </m:UpdateItem>
  </soap:Body>
</soap:Envelope>
